View = require('bamjs/view')
BusList = require('../bus-list')
tmpl = require('./index.jade')

BusListModel = require('../../model/bus-list')
BusLineModel = require('../../model/bus-list/busline')
BusLineCollection = require('../../model/bus-list/buslines')

class MapNav extends View
	namespace = 'map-nav'

	events:
		'click [data-mappin = bus-stop-1]' : 'clickBusStop1'
		'click [data-mappin = bus-stop-2]' : 'clickBusStop2'
		'click [data-mappin = enter-hall]' : 'clickEnterHall'

	initialize: ->
		@$el.html(tmpl())

		@busLineModelArray_1 = [
			{
				Name : '761路（高新区停车场－市政府）'
				Intro : '售票方式：无人售票，票价2元<br>
					发车时间：<br>
					市政府 05:30－18:50<br>
					高新区停车场 7:10－20:30<br>
					沿途站点：高新区停车场－华贯路－祥源路北站－锦荣路－正阳西路－程戈庄－河东路－创业大厦－智力岛路－火炬路－汇智桥路－龙湖滟澜海岸－花溪地－西后楼－东蓝家庄－双埠北－四方长途站－小村庄－海泊桥－鞍山路－图书馆－江西路－市政府'
			}
			{
				Name : '762路环线（高新区停车场－新业路）'
				Intro : '售票方式：无人售票，季节性票价<br>
					发车时间：06:30－18:00<br>
					沿途站点：高新区停车场－华贯路－祥源路北站－科海路－科兴路－瑞源路－科兴路西站－科海路西站－思源路－锦暄路－锦荣路－正阳西路－世茂公园美地－秀园路－河东路－创业大厦－聚贤桥路－暖融路－新地路－创业中心－四方车辆研究所－和融路－火炬支路－新业路'
			}
			{
				Name : '766路（汽车北站－新韵路）'
				Intro : '售票方式：无人售票，季节性票价<br>
					发车时间：05:50－21:00<br>
					沿途站点：汽车北站－赵村－仙山西路－东蓝家庄－西后楼－花溪地－龙湖滟澜海岸－火炬路宝源路－广博路东站－广博路秀园路－广博路汇智桥路－创业大厦－智力岛中路－智力岛路－新韵路聚贤桥路－新韵路和融路－新韵路'
			}
			{
				Name : '767路（汽车北站－新韵路）'
				Intro : '售票方式：无人售票，季节性票价<br>
					发车时间：<br>
					汽车北站 06:00－20:40<br>
					新韵路 05:50－20:40<br>
					沿途站点：汽车北站－安亭路－流亭街道－红埠－流亭医院－东流亭－流亭－高家台小区－流亭国际机场－宝安路－两江路－南城阳－庙头社区－世纪美居－中川路－锦城路－城阳西－城阳村－城子社区－城子－皂户小区－双元路－物流交易中心－和源路丰庆路－星雨华府－河东路华东路－河东路宝源路－河东路华贯路－河东路祥源路－秀园路－河东路－创业大厦－智力岛中路－智力岛路－新韵路聚贤桥路－新韵路和融路－新韵路'
			}
			{
				Name : '770路（创业大厦－新韵路）'
				Intro : '售票方式：无人售票，票价1元<br>
					发车时间：<br>
					新韵路 06:30－20:00<br>
					创业大厦 06:50－20:20<br>
					沿途站点：创业大厦－汇智桥路南站－新业路南站－同顺路－同顺路北站－新业路聚贤桥路－海信模具南－新业路和融路－创业中心－新业路火炬支路－火炬路西站－新韵路'
			}
			{
				Name : '771路（新韵路－创业大厦）'
				Intro : '售票方式：无人售票，票价1元<br>
					发车时间：06:50－20:20<br>
					沿途站点：新韵路－广博路－乐融路广博路－河东路乐融路－河东路和融路－河东路广盛路－河东路聚贤桥路－高新嘉园－高新企业加速器－创业大厦'
			}
			{
				Name : '772路（锦业路－新韵路）'
				Intro : '售票方式：无人售票，票价1元<br>
					发车时间：05:50－19:30<br>
					沿途站点：锦业路－锦安路东站－和源路正阳西路－宝源路－华贯路丰年路－丰年路祥源路－世贸红墅湾－秀园路－河东路－创业大厦－智力岛路－新韵路聚贤桥路－新韵路和融路－新韵路'
			}
			{
				Name : '高新快线（广博路－劲松一路）'
				Intro : '售票方式：无人售票，票价2元<br>
					发车时间：07:15－20:15<br>
					沿途站点：广博路－创业大厦－红岛－劲松一路'
			}
		]
		@busLineCollection_1 = new BusLineCollection(@busLineModelArray_1)
		@busListModel_1 = new BusListModel(
			Name : '创业大厦（汇智桥路西站）'
			BusLines : @busLineCollection_1
		)
		@busList_1 = new BusList(
			el: @$('[data-businfo = bus-info-1]')
			parent: @
			model : @busListModel_1
		)

		@busLineModelArray_2 = [
			{
				Name : '761路（市政府－高新区停车场）'
				Intro : '售票方式：无人售票，票价2元<br>
					发车时间：<br>
					市政府 05:30－18:50<br>
					高新区停车场 7:10－20:30<br>
					沿途站点：市政府－江西路－图书馆－鞍山路－海泊桥－小村庄－四方长途站－双埠北－东蓝家庄－西后楼－花溪地－龙湖滟澜海岸－汇智桥路－火炬路－智力岛路－创业大厦－河东路－程戈庄－正阳西路－锦荣路－祥源路北站－华贯路－高新区停车场'
			}
			{
				Name : '762路环线（新业路－高新区停车场）'
				Intro : '售票方式：无人售票，季节性票价<br>
					发车时间：06:30－18:00<br>
					沿途站点：新业路－新地路－暖融路－聚贤桥路－创业大厦－河东路－秀园路－世茂公园美地－正阳西路－锦荣路－锦暄路－思源路－科海路西站－科兴路西站－瑞源路－科兴路－科海路－祥源路北站－华贯路－高新区停车场'
			}
			{
				Name : '766路（新韵路－汽车北站）'
				Intro : '售票方式：无人售票，季节性票价<br>
					发车时间：05:50－21:00<br>
					沿途站点：新韵路－新韵路和融路－新韵路聚贤桥路－智力岛路－智力岛中路－创业大厦－广博路汇智桥路－广博路秀园路－广博路东站－火炬路宝源路－龙湖滟澜海岸－花溪地－西后楼－东蓝家庄－仙山西路－赵村－汽车北站'
			}
			{
				Name : '767路（新韵路－汽车北站）'
				Intro : '售票方式：无人售票，季节性票价<br>
					发车时间：<br>
					汽车北站 06:00－20:40<br>
					新韵路 05:50－20:40<br>
					沿途站点：新韵路－新韵路和融路－新韵路聚贤桥路－智力岛路－智力岛中路－创业大厦－河东路－秀园路－河东路祥源路－河东路华贯路－河东路宝源路－河东路华东路－星雨华府－和源路丰庆路－物流交易中心－双元路－皂户小区－城子－城子社区－城阳村－城阳西－锦城路－中川路－世纪美居－庙头社区－南城阳－两江路－宝安路－流亭国际机场－高家台小区－流亭－东流亭－流亭医院－红埠－流亭街道－安亭路－汽车北站'
			}
			{
				Name : '770路（新韵路－创业大厦）'
				Intro : '售票方式：无人售票，票价1元<br>
					发车时间：<br>
					新韵路 06:30－20:00<br>
					创业大厦 06:50－20:20<br>
					沿途站点：新韵路－新业路火炬支路－创业中心－新业路和融路－海信模具南－新业路聚贤桥路－同顺路北站－同顺路－新业路南站－汇智桥路南站－创业大厦'
			}
			{
				Name : '772路（新韵路－锦业路）'
				Intro : '售票方式：无人售票，票价1元<br>
					发车时间：<br>
					新韵路 05:55－19:30<br>
					锦业路 06:30－20:05<br>
					沿途站点：新韵路－新韵路和融路－新韵路聚贤桥路－智力岛路－创业大厦－河东路－秀园路－世贸红墅湾－丰年路祥源路－华贯路丰年路－宝源路－和源路正阳西路－和源路－锦业路'
			}
			{
				Name : '高新快线（劲松一路－广博路）'
				Intro : '售票方式：无人售票，票价2元<br>
					发车时间：06:00－19:00<br>
					沿途站点：劲松一路－红岛－创业大厦－广博路'
			}
		]
		@busLineCollection_2 = new BusLineCollection(@busLineModelArray_2)
		@busListModel_2 = new BusListModel(
			Name : '创业大厦（汇智桥路东站）'
			BusLines : @busLineCollection_2
		)
		@busList_2 = new BusList(
			el: @$('[data-businfo = bus-info-2]')
			parent: @
			model : @busListModel_2
		)
	# Events #
	clickBusStop1: (e) ->
		@busList_1.show()

	clickBusStop2: (e) ->
		@busList_2.show()

	clickEnterHall: (e) ->
		alert('建设中')

module.exports = MapNav